bench/out/conditional-update-run2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/hold-contention.js
        output: -

     scenarios: (100.00%) 2 scenarios, 150 max VUs, 1m5s max duration (incl. graceful stop):
              * single_seat: 1 iterations for each of 100 VUs (maxDuration: 30s, exec: singleSeat, gracefulStop: 30s)
              * spread: 50 looping VUs for 20s (exec: spread, startTime: 15s, gracefulStop: 30s)


running (0m01.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  14.0s     

running (0m02.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  13.0s     

running (0m03.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  12.0s     

running (0m04.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  11.0s     

running (0m05.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  10.0s     

running (0m06.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  09.0s     

running (0m07.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  08.0s     

running (0m08.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  07.0s     

running (0m09.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  06.0s     

running (0m10.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  05.0s     

running (0m11.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  04.0s     

running (0m12.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  03.0s     

running (0m13.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  02.0s     

running (0m14.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  01.0s     

running (0m15.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  00.0s     

running (0m16.0s), 050/150 VUs, 935 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [   5% ] 50 VUs   01.0s/20s 

running (0m17.0s), 050/150 VUs, 1968 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  10% ] 50 VUs   02.0s/20s 

running (0m18.0s), 050/150 VUs, 3050 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  15% ] 50 VUs   03.0s/20s 

running (0m19.0s), 050/150 VUs, 4329 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  20% ] 50 VUs   04.0s/20s 

running (0m20.0s), 050/150 VUs, 5692 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  25% ] 50 VUs   05.0s/20s 

running (0m21.0s), 050/150 VUs, 7254 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  30% ] 50 VUs   06.0s/20s 

running (0m22.0s), 050/150 VUs, 9187 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  35% ] 50 VUs   07.0s/20s 

running (0m23.0s), 050/150 VUs, 11270 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  40% ] 50 VUs   08.0s/20s 

running (0m24.0s), 050/150 VUs, 13308 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  45% ] 50 VUs   09.0s/20s 

running (0m25.0s), 050/150 VUs, 15523 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  50% ] 50 VUs   10.0s/20s 

running (0m26.0s), 050/150 VUs, 17722 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  55% ] 50 VUs   11.0s/20s 

running (0m27.0s), 050/150 VUs, 19828 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  60% ] 50 VUs   12.0s/20s 

running (0m28.0s), 050/150 VUs, 21987 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  65% ] 50 VUs   13.0s/20s 

running (0m29.0s), 050/150 VUs, 24148 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  70% ] 50 VUs   14.0s/20s 

running (0m30.0s), 050/150 VUs, 26143 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  75% ] 50 VUs   15.0s/20s 

running (0m31.0s), 050/150 VUs, 28387 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  80% ] 50 VUs   16.0s/20s 

running (0m32.0s), 050/150 VUs, 30548 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  85% ] 50 VUs   17.0s/20s 

running (0m33.0s), 050/150 VUs, 32701 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  90% ] 50 VUs   18.0s/20s 

running (0m34.0s), 050/150 VUs, 34902 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [  95% ] 50 VUs   19.0s/20s 

running (0m35.0s), 050/150 VUs, 37141 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread        [ 100% ] 50 VUs   20.0s/20s 


  █ TOTAL RESULTS 

    CUSTOM
    hold_conflict..................: 16865  481.600065/s
    hold_win.......................: 20376  581.860831/s
    single_seat_latency............: avg=83.82ms med=88.05ms p(95)=116.4ms p(99)=117.39ms max=119.64ms
    spread_latency.................: avg=17.93ms med=15.54ms p(95)=34.65ms p(99)=52.61ms  max=156.75ms

    HTTP
    http_req_duration..............: avg=17.43ms med=15.06ms p(95)=33.83ms p(99)=54.12ms  max=156.75ms
      { expected_response:true }...: avg=17.36ms med=15.21ms p(95)=33.5ms  p(99)=51.03ms  max=145.24ms
    http_req_failed................: 29.27% 16865 out of 57616
    http_reqs......................: 57616  1645.293171/s

    EXECUTION
    iteration_duration.............: avg=27.09ms med=27.62ms p(95)=54.9ms  p(99)=84.34ms  max=181.8ms 
    iterations.....................: 37241  1063.460896/s
    vus............................: 50     min=0              max=50 
    vus_max........................: 150    min=150            max=150

    NETWORK
    data_received..................: 23 MB  663 kB/s
    data_sent......................: 18 MB  506 kB/s



running (0m35.0s), 000/150 VUs, 37241 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.1s/30s  100/100 iters, 1 per VU
spread      ✓ [ 100% ] 50 VUs   20s